Revit 2027 API
BuiltInFailures.DividedPathFailures.DividedPathCannotApplyDivideSettings Property
 Default Divide settings cannot be applied to Divided Path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedPathCannotApplyDivideSettings { get; }
Public Shared ReadOnly Property DividedPathCannotApplyDivideSettings As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedPathCannotApplyDivideSettings {
	FailureDefinitionId^ get ();
}
static member DividedPathCannotApplyDivideSettings : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedPathFailures Class
Autodesk.Revit.DB Namespace